[
  {
    "slug": "the-day-i-fixed-production",
    "title": "The Day I \"Fixed\" Production",
    "date": "2025-02-10",
    "excerpt": "A simple DynamoDB fix in the wrong environment taught me that owning the mistake matters more than the mistake itself.",
    "content": "<p>It was a simple scenario. I was working on a task where <strong>DynamoDB</strong> wasn't properly reading the data in our development environment. Instead of pausing to consult my mentor, I decided to take the \"quick fix\" route: I would be responsible and try to sort some things by myself.</p><p>The problem? I thought so but I wasn't just in dev. I was logged into the <strong>production AWS account</strong>.</p><p>I had the access, so I didn't think twice. It was only later, when I mentioned my \"fix\" to my mentor, that she cautioned me immediately that production is a different beast. Even though I was just trying to bypass a data read issue, I was operating in a space where one wrong command could have deleted entire data entry tables of my team —mission-critical data that would have caused a massive outage.</p><hr/><h3>The Realization</h3><p>The moment I realized the weight of what I had done, my heart dropped. A voice in my head said: <em>Maybe nobody will notice. Maybe just stay quiet and revert it.</em> But hiding almost always makes things worse. It creates doubt and damages trust. Speaking up for me means staying in integrity,  it shows others they can rely on you even when things go wrong.</p><p>Thankfully, the data wasn't corrupted beyond repair, but it still should not have happened. Of course, after the incident, we added some guidelines and even changed the permissions granted to interns for the necessary guardrails to ensure the we as a team don't find ourselves in a similar situation again.</p><h3>What I Learned</h3><p>That day, I learned something important: <strong>mistakes are inevitable, and the best way to handle them is to face them.</strong> One bad moment does not define your career. A single accident does not erase all your hard work. What matters is what you do next—people remember honesty, accountability, and how quickly you learn and recover.</p><h3>The Takeaway</h3><p>If you never touch production, you will never break production. But you will also never grow, never lead, and never build anything important.</p><p>If you want to build, you have to be willing to accept the times you break. You aren't the first person to make a mistake in the cloud, and you won't be the last. The key is to own it, fix what you can, and take that one small lesson forward.</p><hr/>"
  }
]
